import telebot
import random

import random

def randomm():

    mylist = [
               "Թող ինչ-որ մեկը ներկի ձեր եղունգները այնպես, ինչպես ուզում է:",
               "Ձայնային հաղորդագրություն ուղարկեք, թե ինչպես եք երգում ",
              "Պատասխանեք այո միայն մեկ ժամ:",
              "Ձայնագրեք, թե ինչպես եք ձեր դիմահարդարումն անում աչքերը կապած:"
              "Բադի պես ցատկեք մինչև ձեր հաջորդ հերթը",
              "Ցույց տվեք ձեր վերջին հինգ հաղորդագրությունները ձեր հեռախոսում տարբեր մարդկանց:",
              "Բղավեք առաջին բառը, որը գալիս է ձեր մտքին:",
              "Ուղարկեք տեքստ ձեր clipboard-ից ձեր հեռախոսագրքի վերջին անձին:",
              "Յուրաքանչյուր խաղացողի մականուն տվեք:",
              "Յուրաքանչյուր խաղացողի համար վաղվա համար կանխատեսում արեք:",

             ]

    word = (random.choice(mylist))

    return(word)

def Truee():
    mylist = ["Ո՞րն է գաղտնիքը, որը երբեք ոչ մեկին չեք ասել",
              "Ի՞նչ կանեիք, եթե մեկ շաբաթ լինեիք հակառակ սեռի ներկայացուցիչ:",
              "Եթե ​​հանդիպեիք մի ջին, որո՞նք կլինեն ձեր երեք ցանկությունները:",
              "Ինչ կցանկանայիք դառնալ, երբ մեծանաս",
              "Ո՞րն է քո ամենաքիչ սիրած գիրքը և ինչու:",
              "Եթե ​​դուք ստիպված լինեք ջնջել մեկ հավելված ձեր հեռախոսից, ո՞րը կլիներ այն:",
              "Եթե ​​դուք կարողանայիք ամուսնանալ չաթի մարդկանցից հետ  ո՞ւմ կընտրեիք և ինչու",
              "Գնահատեք բոլոր խաղացողներին՝ ձեր ամենաշատից մինչև ամենաքիչ ֆավորիտ:",
              "Որտեղ կցանկանայիք ներկա պահին ժամանակի մեքենան ձեզ տաներ",
              "Եթե ​​ստիպված լինեիք կյանքը փոխել այս սենյակում գտնվող մեկի հետ, ո՞ւմ կընտրեիք:"
              "Ո՞րն է ամենախենթ բանը, որ երբևէ արել եք:",
              "Ի՞նչ կանեք, եթե իմանաք, որ 24 ժամից կմահանաք։",
              "Ե՞րբ եք վերջին անգամ ստել:",
              "Ինչի՞ց եք ամենից շատ վախենում:",
              "Ո՞րն է եղել վերջին բանը, որ փնտրել եք սոցիալական ցանցերում:",
              "Ո՞րն է ամենախայտառակ բանը, որ երբևէ արել եք:",
              "Ո՞րն է եղել ամենավատ բանը, որ երբևէ արել ես քո կյանքում:",
              "Ո՞րն է ամենատարօրինակ բանը, որ երբևէ կերել եք:",
              "Դուք երբևէ խախտե՞լ եք օրենքը:",
              "Ո՞րն է եղել քո ամենատարօրինակ երազանքը:",
              "Ի՞նչ կցանկանայիք, որ բոլորն իմանան ձեր մասին:",
              "Ով է քո լավագույն ընկերը?",
              "Ո՞րն էր ձեր ուշացման ամենահիմար պատճառը:",
              "Ինչի՞ վրա կծախսեք մեկ միլիոն դրամը:"

              
              
              
              ]
    word = (random.choice(mylist))

    return(word)

bot = telebot.TeleBot('6532678746:AAElxrKCBJRzyOZjwpFAmcfkc1YWg-I3768')

@bot.message_handler(commands=['startt'])
def main(message):
    bot.send_message(message.chat.id,f"եթե ցանկանում եք ընտրել ռիսկ գրեք /risk իսկ եթե անկեղծություն /sincerity")


@bot.message_handler(commands=['risk'])
def main(message):
    bot.reply_to(message,str(randomm()))

@bot.message_handler(commands=['sincerity'])
def main(message):
    bot.reply_to(message,str(Truee()))


bot.infinity_polling()
